{
  "history": [
    {
      "id": 1,
      "textQuestion": "Which is the oldest city in Canada?",
      "options": [
        { "id": 1, "text": "Quebec" },
        { "id": 2, "text": "Montreal" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Vancouver" }
      ],
      "answer": { "id": 1, "text": "Quebec" },
      "explanation": {
        "id": 1,
        "text": "Quebec is the oldest city in Canada, founded in 1608 by Samuel de Champlain. Its historical significance lies in its key role in the French colonization of North America."
      }
    },
    {
      "id": 2,
      "textQuestion": "Who was the first European explorer to reach Canada?",
      "options": [
        { "id": 1, "text": "Quebec" },
        { "id": 2, "text": "Montreal" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Vancouver" }
      ],
      "answer": { "id": 1, "text": "Quebec" },
      "explanation": {
        "id": 2,
        "text": "Quebec is the oldest city in Canada, founded in 1608 by Samuel de Champlain. Its historical significance lies in its key role in the French colonization of North America."
      }
    },
    {
      "id": 3,
      "textQuestion": "What was a key event for Canada's expansion in the 19th century?",
      "options": [
        { "id": 1, "text": "War of 1812" },
        { "id": 2, "text": "Treaty of Versailles" },
        { "id": 3, "text": "U.S. War of Independence" },
        { "id": 4, "text": "Incorporation of Vancouver" }
      ],
      "answer": { "id": 4, "text": "Incorporation of Vancouver" },
      "explanation": {
        "id": 3,
        "text": "The incorporation of Vancouver in 1886 was a significant event in Canada's westward expansion. As the first mayor, Malcolm A. MacLean played a role in establishing the city, which grew rapidly due to its strategic location and connection to the Canadian Pacific Railway."
      }
    },
    {
      "id": 4,
      "textQuestion": "In what year was a well-known Canadian landmark built to attract tourism and showcase innovation?",
      "options": [
        { "id": 1, "text": "1970" },
        { "id": 2, "text": "1977" },
        { "id": 3, "text": "1969" },
        { "id": 4, "text": "1971" }
      ],
      "answer": { "id": 2, "text": "1977" },
      "explanation": {
        "id": 4,
        "text": "The Gastown Steam Clock, built in 1977, is one example of a Canadian landmark designed to attract tourists and highlight unique technology. Such projects have played a role in revitalizing historic areas and promoting Canada's cultural and technological heritage."
      }
    },
    {
      "id": 5,
      "textQuestion": "Who is a notable Canadian watchmaker known for designing public clocks?",
      "options": [
        { "id": 1, "text": "Raymond Saunders" },
        { "id": 2, "text": "John Harrison" },
        { "id": 3, "text": "Christiaan Huygens" },
        { "id": 4, "text": "Carole Forestier" }
      ],
      "answer": { "id": 1, "text": "Raymond Saunders" },
      "explanation": {
        "id": 5,
        "text": "Raymond Saunders was the watchmaker who designed and built the Gastown Steam Clock in 1977. He was responsible for its intricate clockwork and steam-powered mechanism."
      }
    },
    {
      "id": 6,
      "textQuestion": "In which war did Canada make its most significant contribution?",
      "options": [
        { "id": 1, "text": "Korean War" },
        { "id": 2, "text": "World War 1" },
        { "id": 3, "text": "World War 2" },
        { "id": 4, "text": "Vietnam War" }
      ],
      "answer": { "id": 2, "text": "World War 1" },
      "explanation": {
        "id": 6,
        "text": "Canada made a significant contribution to World War I, both militarily and economically. Canadian troops played a crucial role in key battles such as Vimy Ridge, Passchendaele, and the Hundred Days Offensive, earning international recognition for their bravery and effectiveness. Canada's efforts helped shape its national identity and establish it as an independent force on the world stage."
      }
    },
    {
      "id": 7,
      "textQuestion": "In which Canadian city was a famous sushi dish, the California Roll, invented?",
      "options": [
        { "id": 1, "text": "Toronto" },
        { "id": 2, "text": "Montreal" },
        { "id": 3, "text": "Vancouver" },
        { "id": 4, "text": "Calgary" }
      ],
      "answer": { "id": 3, "text": "Vancouver" },
      "explanation": {
        "id": 7,
        "text": "The California Roll, a popular sushi dish, was invented in Vancouver in the 1970s by chef Hidekazu Tojo. He modified traditional sushi by using avocado and crab, adapting it to North American tastes. This innovation helped popularize sushi in Canada and beyond."
      }
    },
    {
      "id": 8,
      "textQuestion": "What was the first hospital established in Canada?",
      "options": [
        { "id": 1, "text": "St. Paul's Hospital" },
        { "id": 2, "text": "Toronto General Hospital" },
        { "id": 3, "text": "Hôtel-Dieu de Québec" },
        { "id": 4, "text": "Vancouver General Hospital" }
      ],
      "answer": { "id": 3, "text": "Hôtel-Dieu de Québec" },
      "explanation": {
        "id": 8,
        "text": "Hôtel-Dieu de Québec, founded in 1639 by the Augustinian nuns, was the first hospital in Canada. It played a crucial role in providing medical care to settlers and Indigenous peoples, marking the beginning of organized healthcare in the country."
      }
    },
    {
      "id": 9,
      "textQuestion": "What is the date when Canada became a self-governing country?",
      "options": [
        { "id": 1, "text": "1497" },
        { "id": 2, "text": "1867" },
        { "id": 3, "text": "1776" },
        { "id": 4, "text": "1812" }
      ],
      "answer": { "id": 2, "text": "1867" },
      "explanation": {
        "id": 9,
        "text": "Canada became a self-governing country on July 1, 1867, through the confederation of the original provinces of Ontario, Quebec, New Brunswick, and Nova Scotia. This date is celebrated annually as Canada Day and marks the beginning of Canada's path toward full independence."
      }
    },
    {
      "id": 10,
      "textQuestion": "What is the oldest building in Canada?",
      "options": [
        { "id": 1, "text": "Fortress of Louisbourg" },
        { "id": 2, "text": "Quebec City's Château Frontenac" },
        { "id": 3, "text": "St. John's Basilica" },
        { "id": 4, "text": "Oldest House in Toronto" }
      ],
      "answer": { "id": 1, "text": "Fortress of Louisbourg" },
      "explanation": {
        "id": 10,
        "text": "The Fortress of Louisbourg in Nova Scotia is considered one of Canada's oldest and most significant historic sites. Originally built in the early 1700s, it was a French fortified town and now serves as a national historic site, showcasing the history of early colonial Canada."
      }
    },
    {
      "id": 11,
      "textQuestion": "Which historical park in Canada is known for its size and cultural significance?",
      "options": [
        { "id": 1, "text": "Stanley Park (Vancouver)" },
        { "id": 2, "text": "Banff National Park (Alberta)" },
        {
          "id": 3,
          "text": "Gros Morne National Park (Newfoundland and Labrador)"
        },
        { "id": 4, "text": "Niagara Parks (Ontario)" }
      ],
      "answer": { "id": 2, "text": "Banff National Park" },
      "explanation": {
        "id": 11,
        "text": "Banff National Park, established in 1885, is one of Canada's most historically significant and largest national parks. Covering over 6,600 square kilometers (660,000 hectares), it is renowned for its stunning natural beauty, cultural importance, and role in Canada's early conservation efforts. The park continues to attract millions of visitors each year and plays a key role in Canada's tourism and environmental conservation."
      }
    },
    {
      "id": 12,
      "textQuestion": "What was one of the most important historical deals in Canada's development?",
      "options": [
        { "id": 1, "text": "The Treaty of Paris (1763)" },
        { "id": 2, "text": "The British North America Act (1867)" },
        { "id": 3, "text": "The National Policy (1879)" },
        { "id": 4, "text": "The Canadian Pacific Railway Agreement (1881)" }
      ],
      "answer": {
        "id": 4,
        "text": "The Canadian Pacific Railway Agreement (1881)"
      },
      "explanation": {
        "id": 12,
        "text": "The Canadian Pacific Railway Agreement in 1881 was a crucial moment in Canada’s history, as it laid the groundwork for the completion of the transcontinental railroad. This agreement, linking eastern Canada to the Pacific coast, played a vital role in the country’s expansion, economic development, and the unification of its provinces. The railway was essential for the growth of Canada and its ability to function as a cohesive nation."
      }
    },
    {
      "id": 13,
      "textQuestion": "In what year was the first permanent European settlement established in Canada?",
      "options": [
        { "id": 1, "text": "1534" },
        { "id": 2, "text": "1608" },
        { "id": 3, "text": "1670" },
        { "id": 4, "text": "1750" }
      ],
      "answer": { "id": 2, "text": "1608" },
      "explanation": {
        "id": 13,
        "text": "The first permanent European settlement in Canada was established in 1608 when Samuel de Champlain founded Quebec City. This marked a pivotal moment in Canadian history, as it laid the foundation for French colonization and the development of Canada’s early colonial economy. Quebec City remains one of the oldest European settlements in North America."
      }
    },
    {
      "id": 14,
      "textQuestion": "Which historical Canadian landmark is known for its vast size and national significance?",
      "options": [
        { "id": 1, "text": "Banff National Park (Alberta)" },
        { "id": 2, "text": "The Rideau Canal (Ontario)" },
        {
          "id": 3,
          "text": "Cape Breton Highlands National Park (Nova Scotia)"
        },
        { "id": 4, "text": "St. Lawrence River" }
      ],
      "answer": { "id": 2, "text": "The Rideau Canal (Ontario)" },
      "explanation": {
        "id": 14,
        "text": "The Rideau Canal, completed in 1832, is a historical Canadian landmark with great national significance. Stretching over 202 kilometers (125 miles), it connects Ottawa to Lake Ontario and the St. Lawrence River. The canal played a crucial role in the defense and transportation of goods in early Canadian history and was designated a UNESCO World Heritage Site in 2007, highlighting its historical and engineering importance."
      }
    },
    {
      "id": 15,
      "textQuestion": "Which early European explorer was among the first to map parts of Canada's coastline?",
      "options": [
        { "id": 1, "text": "Samuel de Champlain" },
        { "id": 2, "text": "Samuel de Champlain" },
        { "id": 3, "text": "José María Narváez" },
        { "id": 4, "text": "Henry Hudson" }
      ],
      "answer": { "id": 1, "text": "Jacques Cartier" },
      "explanation": {
        "id": 15,
        "text": "Jacques Cartier, a French explorer, was one of the first Europeans to map parts of Canada’s coastline in the 16th century. His expeditions in 1534-1542 along the Gulf of St. Lawrence were crucial in laying the foundations for French exploration and settlement in what would become New France. His efforts in charting the region helped establish Canada's early European history."
      }
    }
  ],

  "Sports": [
    {
      "id": 1,
      "textQuestion": "What sport is considered one of the most popular and historically significant in Canada?",
      "options": [
        { "id": 1, "text": "Ice hockey" },
        { "id": 2, "text": "Lacrosse" },
        { "id": 3, "text": "Basketball" },
        { "id": 4, "text": "Soccer" }
      ],
      "answer": { "id": 1, "text": "Ice hockey" },
      "explanation": {
        "id": 1,
        "text": "Ice hockey is widely regarded as Canada's national sport and holds great historical significance. It became popular in the late 19th century and has since developed into a major part of Canada's cultural identity. The country has produced numerous legendary players and remains a dominant force in international competitions such as the NHL and the Winter Olympics."
      }
    },
    {
      "id": 2,
      "textQuestion": "Which Canadian sports team is internationally recognized and has a rich history?",
      "options": [
        { "id": 1, "text": "Toronto Raptors" },
        { "id": 2, "text": "Vancouver Canucks" },
        { "id": 3, "text": "Montreal Canadiens" },
        { "id": 4, "text": "Calgary Flames" }
      ],
      "answer": { "id": 3, "text": "Montreal Canadiens" },
      "explanation": {
        "id": 2,
        "text": "The Montreal Canadiens, one of the oldest and most successful teams in the National Hockey League (NHL), are internationally recognized. Founded in 1909, the team has won 24 Stanley Cups, the most in NHL history. Their legacy in Canadian hockey and global sports culture is a significant part of Canada's sports history."
      }
    },
    {
      "id": 3,
      "textQuestion": "Which Canadian sports team has the largest fanbase across the country?",
      "options": [
        { "id": 1, "text": "Toronto Maple Leafs (NHL)" },
        { "id": 2, "text": "Montreal Canadiens (NHL)" },
        { "id": 3, "text": "Vancouver Canucks (NHL)" },
        { "id": 4, "text": "Toronto Raptors (NBA)" }
      ],
      "answer": { "id": 1, "text": "Toronto Maple Leafs (NHL)" },
      "explanation": {
        "id": 3,
        "text": "The Toronto Maple Leafs, one of the oldest and most successful hockey teams in Canada, have one of the largest fanbases across the country. Hockey is Canada's national sport, and teams like the Maple Leafs and Montreal Canadiens have a deep historical and cultural connection with fans nationwide, making them central to Canada's sports landscape."
      }
    },
    {
      "id": 4,
      "textQuestion": "Which Canadian city is home to an NBA team?",
      "options": [
        { "id": 1, "text": "Vancouver" },
        { "id": 2, "text": "Toronto" },
        { "id": 3, "text": "Montreal" },
        { "id": 4, "text": "Calgary" }
      ],
      "answer": { "id": 2, "text": "Toronto" },
      "explanation": {
        "id": 4,
        "text": "Toronto is home to the Toronto Raptors, Canada's only NBA team. The Raptors are a significant part of Canadian sports culture and have had a strong impact on the popularity of basketball across the country. In the past, Vancouver also had an NBA team, the Vancouver Grizzlies, before the franchise relocated to Memphis in 2001."
      }
    },
    {
      "id": 5,
      "textQuestion": "How many Canadian Championships has the Vancouver Whitecaps?",
      "options": [
        { "id": 1, "text": "4" },
        { "id": 2, "text": "5" },
        { "id": 3, "text": "3" },
        { "id": 4, "text": "6" }
      ],
      "answer": { "id": 1, "text": "4" },
      "explanation": {
        "id": 5,
        "text": "The Vancouver Whitecaps have won four Canadian Championships in these years: 2015,2022,2023 and 2024."
      }
    },
    {
      "id": 6,
      "textQuestion": "Which sport is considered Canada's national winter sport?",
      "options": [
        { "id": 1, "text": "Ice Hockey" },
        { "id": 2, "text": "Lacrosse" },
        { "id": 3, "text": "Curling" },
        { "id": 4, "text": "Skiing" }
      ],
      "answer": { "id": 1, "text": "Ice hockey" },
      "explanation": {
        "id": 6,
        "text": "Ice hockey is widely considered Canada's national winter sport. The sport has deep historical roots in the country, with the first organized games played in the 19th century"
      }
    },
    {
      "id": 7,
      "textQuestion": "Which sport is considered Canada's national summer sport?",
      "options": [
        { "id": 1, "text": "Lacrosse" },
        { "id": 2, "text": "Baseball" },
        { "id": 3, "text": "Soccer" },
        { "id": 4, "text": "Rugby" }
      ],
      "answer": { "id": 1, "text": "Lacrosse" },
      "explanation": {
        "id": 7,
        "text": "Historically, lacrosse was an outdoor game played by Indigenous peoples during the warmer months, when the weather was suitable for outdoor activities. The game was often played in the summer to take advantage of the longer daylight hours and milder temperatures."
      }
    },
    {
      "id": 8,
      "textQuestion": "Since when Lacrosse is considering a national sport?",
      "options": [
        { "id": 1, "text": "1870" },
        { "id": 2, "text": "1859" },
        { "id": 3, "text": "1840" },
        { "id": 4, "text": "1860" }
      ],
      "answer": { "id": 2, "text": "1859" },
      "explanation": {
        "id": 8,
        "text": "Lacrosse has been Canada's national sport since 1859 due to its deep Indigenous roots. Indigenous peoples played the game long before European settlers, and its formal organization in the 19th century highlights its cultural significance to Canada."
      }
    },
    {
      "id": 9,
      "textQuestion": "Which combat sport is popular in Canada and has produced numerous world-renowned athletes?",
      "options": [
        { "id": 1, "text": "Boxing" },
        { "id": 2, "text": "Mix Martial Arts(MMA)" },
        { "id": 3, "text": "Wrestling" },
        { "id": 4, "text": "Judo" }
      ],
      "answer": { "id": 1, "text": "Boxing" },
      "explanation": {
        "id": 9,
        "text": "Boxing is a well-known combat sport in Canada, with the country having produced several world-class athletes. Notable Canadian boxers include George Chuvalo, who was a heavyweight contender, and Lennox Lewis, who became the undisputed heavyweight champion."
      }
    },
    {
      "id": 10,
      "textQuestion": "Which stadium has the largest seating capacity in Canada?",
      "options": [
        { "id": 1, "text": "Rogers Centre (Toronto)" },
        { "id": 2, "text": "Commonwealth Stadium (Edmonton)" },
        { "id": 3, "text": "BC Place Stadium (Vancouver)" },
        { "id": 4, "text": "TD Place Stadium (Ottawa)" }
      ],
      "answer": { "id": 3, "text": "BC Place Stadium" },
      "explanation": {
        "id": 10,
        "text": "BC Place Stadium in Vancouver has the largest seating capacity in Canada, with a capacity of over 54,000 for sports events. It hosts a wide range of sporting events, including football, soccer, and rugby, as well as concerts and other large-scale entertainment events."
      }
    },
    {
      "id": 11,
      "textQuestion": "Which Canadian city is home to the NHL team, the Montreal Canadiens?",
      "options": [
        { "id": 1, "text": "Vancouver" },
        { "id": 2, "text": "Ottawa" },
        { "id": 3, "text": "Montreal" },
        { "id": 4, "text": "Calgary" }
      ],
      "answer": { "id": 3, "text": "Montreal" },
      "explanation": {
        "id": 11,
        "text": "The Montreal Canadiens, one of the most successful and iconic teams in the National Hockey League (NHL), are based in Montreal, Quebec. Founded in 1909, the Canadiens have a rich history and have won the most Stanley Cup championships in NHL history, making them a central part of Canada's hockey culture."
      }
    },
    {
      "id": 12,
      "textQuestion": "Which Canadian city is known for often hosting the annual Grey Cup, Canada's premier football championship?",
      "options": [
        { "id": 1, "text": "Montreal" },
        { "id": 2, "text": "Calgary" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Winnipeg" }
      ],
      "answer": { "id": 4, "text": "Winnipeg" },
      "explanation": {
        "id": 12,
        "text": "The Grey Cup, Canada's top professional football championship, is hosted annually in various cities, with Winnipeg frequently hosting the event. It is a major sporting occasion that unites fans and athletes across Canada."
      }
    },
    {
      "id": 13,
      "textQuestion": "Which Canadian martial artist is best known in Canada?",
      "options": [
        { "id": 1, "text": "Georges St-Pierre" },
        { "id": 2, "text": "Rory MacDonald" },
        { "id": 3, "text": "Patrick Côté" },
        { "id": 4, "text": "Carlos Newton" }
      ],
      "answer": { "id": 1, "text": "Georges St-Pierre" },
      "explanation": {
        "id": 13,
        "text": "Georges St-Pierre is Canada's most famous martial artist, considered one of the greatest MMA fighters of all time. A former UFC welterweight and middleweight champion, he is known for his skill, sportsmanship, and dominance in the octagon."
      }
    },
    {
      "id": 14,
      "textQuestion": "Which female canadian athlete is recognized worldwide in soccer?",
      "options": [
        { "id": 1, "text": "Christine Sinclair" },
        { "id": 2, "text": "Alphonso Davies" },
        { "id": 3, "text": "Dwayne De Rosario" },
        { "id": 4, "text": "Julian De Guzman" }
      ],
      "answer": { "id": 1, "text": "Christine Sinclair" },
      "explanation": {
        "id": 14,
        "text": "She is considered one of the greatest female soccer players of all time, holding the record for the most international goals scored by any player, male or female, in the history of international soccer."
      }
    },
    {
      "id": 15,
      "textQuestion": "Has Canada ever won the Davis Cup, the prestigious World Cup of tennis?",
      "options": [
        { "id": 1, "text": "Yes" },
        { "id": 2, "text": "No" }
      ],
      "answer": { "id": 1, "text": "Yes" },
      "explanation": {
        "id": 15,
        "text": "Yes, Canada has won the Davis Cup.This victory was significant as it was Canada's first time winning the prestigious tournament, with the team led by notable players such as Felix Auger-Aliassime and Denis Shapovalov."
      }
    }
  ],

  "Places": [
    {
      "id": 1,
      "textQuestion": "Which of the following is a famous park in Canada?",
      "options": [
        { "id": 1, "text": "Stanley Park" },
        { "id": 2, "text": "Central Park" },
        { "id": 3, "text": "Banff National Park" },
        { "id": 4, "text": "South Mountain Park" }
      ],
      "answer": { "id": 3, "text": "Banff National Park" },
      "explanation": {
        "id": 1,
        "text": "It is known for its stunning mountain landscapes, glaciers, and turquoise lakes. While Stanley Park in Vancouver is also a well-known park, Banff is recognized worldwide for its natural beauty and significance as Canada's first national park."
      }
    },
    {
      "id": 2,
      "textQuestion": "Where is located a famous clock in Canada",
      "options": [
        { "id": 1, "text": "Montreal" },
        { "id": 2, "text": "Quebec" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Vancouver" }
      ],
      "answer": { "id": 4, "text": "Vancouver" },
      "explanation": {
        "id": 2,
        "text": "The famous Gastown Steam Clock in Vancouver was built in 1977. It is powered by steam and is one of the only steam-powered clocks in the world. The clock also features a unique hourly chime."
      }
    },
    {
      "id": 3,
      "textQuestion": "Which Canadian city is known for having the world's largest indoor aquarium?",
      "options": [
        { "id": 1, "text": "Montreal" },
        { "id": 2, "text": "Toronto" },
        { "id": 3, "text": "Calgary" },
        { "id": 4, "text": "Vancouver" }
      ],
      "answer": { "id": 4, "text": "Vancouver" },
      "explanation": {
        "id": 3,
        "text": "The Vancouver Aquarium, located in Stanley Park, is one of the largest and most popular aquariums in Canada, known for its commitment to marine conservation and education."
      }
    },
    {
      "id": 4,
      "textQuestion": "What is the name of the famous national park in Alberta known for its stunning mountain scenery and hot springs?",
      "options": [
        { "id": 1, "text": "Jasper National Park" },
        { "id": 2, "text": "Banff National Park" },
        { "id": 3, "text": "Yoho National Park" },
        { "id": 4, "text": "Pacific Rim National Park" }
      ],
      "answer": { "id": 2, "text": "Banff National Park" },
      "explanation": {
        "id": 4,
        "text": "Banff National Park, established in 1885, is Canada's oldest national park and is a UNESCO World Heritage Site, attracting millions of visitors each year for its natural beauty and outdoor activities."
      }
    },
    {
      "id": 5,
      "textQuestion": "Which island off the coast of British Columbia is famous for its whale-watching opportunities and pristine wilderness?",
      "options": [
        { "id": 1, "text": "Vancouver Island" },
        { "id": 2, "text": "Prince Edward Island" },
        { "id": 3, "text": "Baffin Island" },
        { "id": 4, "text": "Newfoundland" }
      ],
      "answer": { "id": 1, "text": "Vancouver Island" },
      "explanation": {
        "id": 5,
        "text": "Vancouver Island is renowned for its rich biodiversity and is a top destination for whale-watching, especially for orca and humpback whales."
      }
    },
    {
      "id": 6,
      "textQuestion": "Where can you find the world's largest tides, which rise and fall by up to 16 meters?",
      "options": [
        { "id": 1, "text": "Bay of Fundy" },
        { "id": 2, "text": "Great Bear Lake" },
        { "id": 3, "text": "Niagara Falls" },
        { "id": 4, "text": "St. Lawrence River" }
      ],
      "answer": { "id": 1, "text": "Bay of Fundy" },
      "explanation": {
        "id": 6,
        "text": "The Bay of Fundy, located between New Brunswick and Nova Scotia, is known for having the highest tidal range in the world, creating spectacular natural sights."
      }
    },
    {
      "id": 7,
      "textQuestion": "Which city in Canada is known for its historic Old Quebec district, a UNESCO World Heritage Site?",
      "options": [
        { "id": 1, "text": "Ottawa" },
        { "id": 2, "text": "Montreal" },
        { "id": 3, "text": "Quebec City" },
        { "id": 4, "text": "Toronto" }
      ],
      "answer": { "id": 3, "text": "Quebec City" },
      "explanation": {
        "id": 7,
        "text": "The Old Quebec district is the only fortified city in North America and boasts cobblestone streets, historic buildings, and landmarks like Château Frontenac, making it one of Canada's most picturesque locations."
      }
    },
    {
      "id": 8,
      "textQuestion": "Which Canadian province is known for its iconic Rocky Mountains, attracting hikers, skiers, and nature enthusiasts?",
      "options": [
        { "id": 1, "text": "British Columbia" },
        { "id": 2, "text": "Alberta" },
        { "id": 3, "text": "Quebec" },
        { "id": 4, "text": "Ontario" }
      ],
      "answer": { "id": 2, "text": "Alberta" },
      "explanation": {
        "id": 8,
        "text": "The Rocky Mountains in Alberta are home to world-renowned national parks such as Banff and Jasper, where visitors can enjoy outdoor activities year-round, including skiing in the winter and hiking in the summer."
      }
    },
    {
      "id": 9,
      "textQuestion": "Which Canadian city is known for its beautiful waterfront, historic buildings, and being the gateway to Niagara Falls?",
      "options": [
        { "id": 1, "text": "Kingston" },
        { "id": 2, "text": "Ottawa" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Hamilton" }
      ],
      "answer": { "id": 3, "text": "Toronto" },
      "explanation": {
        "id": 9,
        "text": "Toronto is Canada's largest city and boasts a stunning waterfront along Lake Ontario, with cultural attractions, shopping, and being just a short drive away from the iconic Niagara Falls."
      }
    },
    {
      "id": 10,
      "textQuestion": "Which Canadian province is home to the world-famous Capilano Suspension Bridge?",
      "options": [
        { "id": 1, "text": "Quebec" },
        { "id": 2, "text": "Ontario" },
        { "id": 3, "text": "Nova Scotia" },
        { "id": 4, "text": "British Columbia" }
      ],
      "answer": { "id": 4, "text": "British Columbia" },
      "explanation": {
        "id": 10,
        "text": "The Capilano Suspension Bridge in Vancouver, British Columbia, is a 137-meter-long bridge suspended high above the Capilano River, offering a unique view of the surrounding rainforest."
      }
    },
    {
      "id": 11,
      "textQuestion": "Which Canadian province is home to the stunning ice fields, including the famous Athabasca Glacier?",
      "options": [
        { "id": 1, "text": "Alberta" },
        { "id": 2, "text": "Ontario" },
        { "id": 3, "text": "Quebec" },
        { "id": 4, "text": "British Columbia" }
      ],
      "answer": { "id": 1, "text": "Alberta" },
      "explanation": {
        "id": 11,
        "text": "The Athabasca Glacier is part of the Columbia Icefield in the Canadian Rockies, one of the largest icefields in North America. Visitors can take guided tours to walk on the glacier or ride a specially designed Ice Explorer."
      }
    },
    {
      "id": 12,
      "textQuestion": "Which province in Canada is the only one officially bilingual, with both French and English as official languages?",
      "options": [
        { "id": 1, "text": "Quebec" },
        { "id": 2, "text": "Ontario" },
        { "id": 3, "text": "New Brunswick" },
        { "id": 4, "text": "Nova Scotia" }
      ],
      "answer": { "id": 3, "text": "New Brunswick" },
      "explanation": {
        "id": 12,
        "text": "New Brunswick is the only officially bilingual province in Canada, where both English and French are recognized as official languages, reflecting its rich Francophone and Anglophone heritage."
      }
    },
    {
      "id": 13,
      "textQuestion": "Which Canadian province is known for its vast wilderness, including over 20 national parks?",
      "options": [
        { "id": 1, "text": "Alberta" },
        { "id": 2, "text": "Quebec" },
        { "id": 3, "text": "British Columbia" },
        { "id": 4, "text": "Ontario" }
      ],
      "answer": { "id": 2, "text": "Quebec" },
      "explanation": {
        "id": 13,
        "text": "Quebec is home to over 20 national parks, including some of Canada's most remote and beautiful landscapes, like the Gaspé Peninsula and Parc de la Mauricie."
      }
    },
    {
      "id": 14,
      "textQuestion": "Which Canadian territory is known for its stunning northern lights and polar bear sightings?",
      "options": [
        { "id": 1, "text": "Yukon" },
        { "id": 2, "text": "Northwest Territories" },
        { "id": 3, "text": "Nunavut" },
        { "id": 4, "text": "Prince Edward Island" }
      ],
      "answer": { "id": 2, "text": "Northwest Territories" },
      "explanation": {
        "id": 14,
        "text": "The Northwest Territories is one of the best places in the world to view the Northern Lights, and it is also a prime destination for polar bear sightings."
      }
    },
    {
      "id": 15,
      "textQuestion": "Which Canadian city is known for hosting one of the world's largest jazz festivals?",
      "options": [
        { "id": 1, "text": "Vancouver" },
        { "id": 2, "text": "Quebec" },
        { "id": 3, "text": "Toronto" },
        { "id": 4, "text": "Montreal" }
      ],
      "answer": { "id": 4, "text": "Montreal" },
      "explanation": {
        "id": 15,
        "text": "The Montreal International Jazz Festival is the largest jazz festival in the world, attracting thousands of artists and fans every summer."
      }
    },
    {
      "id": 16,
      "textQuestion": "Which large Canadian national park is located in the northern part of the country and is known for its polar bears?",
      "options": [
        { "id": 1, "text": "Banff National Park" },
        { "id": 2, "text": "Jasper National Park" },
        { "id": 3, "text": "Kluane National Park" },
        { "id": 4, "text": "Wapusk National Park" }
      ],
      "answer": { "id": 4, "text": "Wapusk National Park" },
      "explanation": {
        "id": 16,
        "text": "Wapusk National Park, located in Manitoba, is one of the best places in Canada to see polar bears in their natural habitat, especially during the fall months."
      }
    }
  ],

  "Art": [
    {
      "id": 1,
      "textQuestion": "Who is considered one of Canada's most famous painters and is known for her depictions of Indigenous culture and the Pacific Northwest landscapes?",
      "options": [
        { "id": 1, "text": "Tom Thomson" },
        { "id": 2, "text": "Emily Carr" },
        { "id": 3, "text": "Lawren Harris" },
        { "id": 4, "text": "Jean-Paul Riopelle" }
      ],
      "answer": { "id": 2, "text": "Emily Carr" },
      "explanation": {
        "id": 1,
        "text": "Emily Carr was a Canadian artist and writer known for her paintings of Indigenous totem poles and the landscapes of British Columbia. She was one of the first artists in Canada to portray Indigenous themes in her work."
      }
    },
    {
      "id": 2,
      "textQuestion": "Which famous group of Canadian painters focused on landscapes and helped define a unique national art style in the early 20th century?",
      "options": [
        { "id": 1, "text": "The Canadian Impressionists" },
        { "id": 2, "text": "The Group of Seven" },
        { "id": 3, "text": "The Prairie Realists" },
        { "id": 4, "text": "The Montreal School" }
      ],
      "answer": { "id": 2, "text": "The Group of Seven" },
      "explanation": {
        "id": 2,
        "text": "The Group of Seven was a collective of artists in the 1920s known for their bold, colorful depictions of the Canadian wilderness, particularly in Ontario and the Rocky Mountains."
      }
    },
    {
      "id": 3,
      "textQuestion": "Which Canadian artist is famous for creating large-scale sculptures inspired by Indigenous traditions, including The Spirit of Haida Gwaii?",
      "options": [
        { "id": 1, "text": "Bill Reid" },
        { "id": 2, "text": "Kenojuak Ashevak" },
        { "id": 3, "text": "Robert Davidson" },
        { "id": 4, "text": "Alex Janvier" }
      ],
      "answer": { "id": 1, "text": "Bill Reid" },
      "explanation": {
        "id": 3,
        "text": "Bill Reid was a Haida artist and sculptor known for his intricate carvings and monumental works, such as The Spirit of Haida Gwaii, which is featured at the Canadian Embassy in Washington, D.C."
      }
    },
    {
      "id": 4,
      "textQuestion": "Which Canadian museum houses the world's largest collection of Inuit art?",
      "options": [
        { "id": 1, "text": "Art Gallery of Ontario" },
        { "id": 2, "text": "The National Gallery of Canada" },
        { "id": 3, "text": "Winnipeg Art Gallery" },
        { "id": 4, "text": "Montreal Museum of Fine Arts" }
      ],
      "answer": { "id": 3, "text": "Winnipeg Art Gallery" },
      "explanation": {
        "id": 4,
        "text": "The Winnipeg Art Gallery (WAG) is home to the world's largest public collection of contemporary Inuit art, showcasing sculptures, prints, and drawings from Arctic communities."
      }
    },
    {
      "id": 5,
      "textQuestion": "What is the name of Canada's most prestigious art award, given annually to a contemporary artist?",
      "options": [
        { "id": 1, "text": "The Sobey Art Award" },
        { "id": 2, "text": "The Governor General's Award for Visual Arts" },
        { "id": 3, "text": "The Canadian Art Prize" },
        { "id": 4, "text": "The Emily Carr Award" }
      ],
      "answer": { "id": 1, "text": "The Sobey Art Award" },
      "explanation": {
        "id": 5,
        "text": "The Sobey Art Award is Canada's most prestigious contemporary art prize, awarded annually to a Canadian artist under the age of 40 who has made a significant impact on the art scene."
      }
    },
    {
      "id": 6,
      "textQuestion": "Which Canadian Inuit artist was famous for her prints and drawings of Arctic wildlife and traditional Inuit stories?",
      "options": [
        { "id": 1, "text": "Annie Pootoogook" },
        { "id": 2, "text": "Pitseolak Ashoona" },
        { "id": 3, "text": "Kenojuak Ashevak" },
        { "id": 4, "text": "Napachie Pootoogook" }
      ],
      "answer": { "id": 3, "text": "Kenojuak Ashevak" },
      "explanation": {
        "id": 6,
        "text": "Kenojuak Ashevak was a pioneering Inuit artist known for her bold, colorful prints of Arctic animals and spiritual imagery, including The Enchanted Owl, which appeared on a Canadian postage stamp."
      }
    },
    {
      "id": 7,
      "textQuestion": "Which Canadian province is known for its many murals and street art, especially in Montreal?",
      "options": [
        { "id": 1, "text": "Alberta" },
        { "id": 2, "text": "Quebec" },
        { "id": 3, "text": "Manitoba" },
        { "id": 4, "text": "Nova Scotia" }
      ],
      "answer": { "id": 2, "text": "Quebec" },
      "explanation": {
        "id": 7,
        "text": "Quebec is known for its street art, especially in Montreal, which hosts the annual MURAL Festival where artists paint large murals on city walls."
      }
    },
    {
      "id": 8,
      "textQuestion": "Which type of Canadian art is often made by Inuit artists?",
      "options": [
        { "id": 1, "text": "Oil painting" },
        { "id": 2, "text": "Watercolor" },
        { "id": 3, "text": "Stone carving" },
        { "id": 4, "text": "Graffiti" }
      ],
      "answer": { "id": 3, "text": "Stone carving" },
      "explanation": {
        "id": 8,
        "text": "Inuit artists make detailed stone carvings of animals, people, and spirits, often using soapstone or ivory."
      }
    },
    {
      "id": 9,
      "textQuestion": "Which Canadian painter is known for their bright and colorful Indigenous-style paintings of animals and spirits?",
      "options": [
        { "id": 1, "text": "Norval Morrisseau" },
        { "id": 2, "text": "Lawren Harris" },
        { "id": 3, "text": "Emily Carr" },
        { "id": 4, "text": "Kenojuak Ashevak" }
      ],
      "answer": { "id": 1, "text": "Norval Morrisseau" },
      "explanation": {
        "id": 9,
        "text": "Norval Morrisseau, also called Copper Thunderbird, was the founder of the Woodland School of Art, which combined Indigenous traditions with modern painting styles."
      }
    },
    {
      "id": 10,
      "textQuestion": "Which member of the Group of Seven is famous for painting Canada's Arctic landscapes?",
      "options": [
        { "id": 1, "text": "Tom Thomson" },
        { "id": 2, "text": "A.Y. Jackson" },
        { "id": 3, "text": "J.E.H. MacDonald" },
        { "id": 4, "text": "Lawren Harris" }
      ],
      "answer": { "id": 4, "text": "Lawren Harris" },
      "explanation": {
        "id": 10,
        "text": "Lawren Harris painted the icy mountains and glaciers of Canada's Arctic, using simple shapes and strong colors."
      }
    },
    {
      "id": 11,
      "textQuestion": "What type of paint did the Group of Seven mostly use for their landscape paintings?",
      "options": [
        { "id": 1, "text": "Watercolor" },
        { "id": 2, "text": "Oil paint" },
        { "id": 3, "text": "Acrylic paint" },
        { "id": 4, "text": "Ink" }
      ],
      "answer": { "id": 2, "text": "Oil paint" },
      "explanation": {
        "id": 11,
        "text": "The Group of Seven used thick oil paints to create strong textures and bold colors in their landscape paintings."
      }
    },
    {
      "id": 12,
      "textQuestion": "Which Canadian artist was a leader of the Automatistes, a group that painted in an abstract and spontaneous style?",
      "options": [
        { "id": 1, "text": "Paul-Émile Borduas" },
        { "id": 2, "text": "Emily Carr" },
        { "id": 3, "text": "Alex Colville" },
        { "id": 4, "text": "Jean-Paul Riopelle" }
      ],
      "answer": { "id": 1, "text": "Paul-Émile Borduas" },
      "explanation": {
        "id": 12,
        "text": "Paul-Émile Borduas helped create the Refus Global manifesto, which encouraged freedom in art and expression in Quebec."
      }
    },
    {
      "id": 13,
      "textQuestion": "Which famous Canadian painting by Tom Thomson shows a lone tree against a bright sky?",
      "options": [
        { "id": 1, "text": "Mountain Forms" },
        { "id": 2, "text": "North Shore, Lake Superior" },
        { "id": 3, "text": "The West Wind" },
        { "id": 4, "text": "The Jack Pine" }
      ],
      "answer": { "id": 4, "text": "The Jack Pine" },
      "explanation": {
        "id": 13,
        "text": "The Jack Pine is one of the most famous paintings in Canadian history, showing the strength of nature and the beauty of Canada's forests."
      }
    },
    {
      "id": 14,
      "textQuestion": "Which Canadian painter is known for his realistic paintings of rural life, including Horse and Train?",
      "options": [
        { "id": 1, "text": "Tom Thomson" },
        { "id": 2, "text": "Emily Carr" },
        { "id": 3, "text": "Alex Colville" },
        { "id": 4, "text": "Lawren Harris" }
      ],
      "answer": { "id": 3, "text": "Alex Colville" },
      "explanation": {
        "id": 14,
        "text": "Horse and Train is one of Colville's most famous works, showing a horse running toward an oncoming train, symbolizing fate and choices."
      }
    },
    {
      "id": 15,
      "textQuestion": "What is the name of the Indigenous artist who painted colorful spiritual images in the Woodland art style?",
      "options": [
        { "id": 1, "text": "Emily Carr" },
        { "id": 2, "text": "Norval Morrisseau" },
        { "id": 3, "text": "Bill Reid" },
        { "id": 4, "text": "Cornelius Krieghoff" }
      ],
      "answer": { "id": 2, "text": "Norval Morrisseau" },
      "explanation": {
        "id": 15,
        "text": "Norval Morrisseau's paintings often showed spiritual stories from Anishinaabe culture. His unique style influenced many Indigenous artists in Canada."
      }
    },
    {
      "id": 16,
      "textQuestion": "What is the name of the painting by Lawren Harris that shows an icy mountain and is Canada's most expensive painting ever sold at auction?",
      "options": [
        { "id": 1, "text": "The West Wind" },
        { "id": 2, "text": "North Shore, Lake Superior" },
        { "id": 3, "text": "Mountain Forms" },
        { "id": 4, "text": "The Enchanted Owl" }
      ],
      "answer": { "id": 3, "text": "Mountain Forms" },
      "explanation": {
        "id": 16,
        "text": "Mountain Forms was sold in 2016 for over $11 million, making it the most expensive Canadian painting ever sold at auction."
      }
    }
  ],

  "Food": [
    {
      "id": 1,
      "textQuestion": "What is the national dish of Canada?",
      "options": [
        { "id": 1, "text": "Poutine" },
        { "id": 2, "text": "Butter Tart" },
        { "id": 3, "text": "Tourtière" },
        { "id": 4, "text": "Nanaimo Bar" }
      ],
      "answer": { "id": 1, "text": "Poutine" },
      "explanation": {
        "id": 1,
        "text": "Poutine, originally from Quebec, consists of French fries topped with cheese curds and smothered in gravy. It is one of the most iconic Canadian dishes."
      }
    },
    {
      "id": 2,
      "textQuestion": "Which Canadian province is famous for its lobster?",
      "options": [
        { "id": 1, "text": "Alberta" },
        { "id": 2, "text": "Nova Scotia" },
        { "id": 3, "text": "British Columbia" },
        { "id": 4, "text": "Manitoba" }
      ],
      "answer": { "id": 2, "text": "Nova Scotia" },
      "explanation": {
        "id": 2,
        "text": "Nova Scotia is well known for its fresh seafood, particularly its high-quality lobster, which is a major part of the local economy."
      }
    },
    {
      "id": 3,
      "textQuestion": "What is a traditional French-Canadian meat pie called?",
      "options": [
        { "id": 1, "text": "Pâté Chinois" },
        { "id": 2, "text": "Bannock" },
        { "id": 3, "text": "Tourtière" },
        { "id": 4, "text": "Flipper Pie" }
      ],
      "answer": { "id": 3, "text": "Tourtière" },
      "explanation": {
        "id": 3,
        "text": "Tourtière is a traditional Quebecois meat pie, usually made with minced pork, beef, or veal and seasoned with spices."
      }
    },
    {
      "id": 4,
      "textQuestion": "Which ingredient is essential in a Nanaimo bar?",
      "options": [
        { "id": 1, "text": "Cheese curds" },
        { "id": 2, "text": "Graham cracker crumbs" },
        { "id": 3, "text": "Maple syrup" },
        { "id": 4, "text": "Ketchup" }
      ],
      "answer": { "id": 2, "text": "Graham cracker crumbs" },
      "explanation": {
        "id": 4,
        "text": "Nanaimo bars, a no-bake dessert from British Columbia, consist of three layers: a crumbly graham cracker base, custard filling, and chocolate topping."
      }
    },
    {
      "id": 5,
      "textQuestion": "Which province is most famous for producing maple syrup?",
      "options": [
        { "id": 1, "text": "Saskatchewan" },
        { "id": 2, "text": "Newfoundland and Labrador" },
        { "id": 3, "text": "Prince Edward Island" },
        { "id": 4, "text": "Quebec" }
      ],
      "answer": { "id": 4, "text": "Quebec" },
      "explanation": {
        "id": 5,
        "text": "Quebec produces over 70% of the world's maple syrup, making it the largest producer globally."
      }
    },
    {
      "id": 6,
      "textQuestion": "What is a common topping for Canadian peameal bacon?",
      "options": [
        { "id": 1, "text": "Maple syrup" },
        { "id": 2, "text": "Ketchup" },
        { "id": 3, "text": "Mustard" },
        { "id": 4, "text": "Cheese" }
      ],
      "answer": { "id": 3, "text": "Mustard" },
      "explanation": {
        "id": 6,
        "text": "Peameal bacon, a Toronto specialty, is often served in a sandwich with mustard, enhancing its savory flavor."
      }
    },
    {
      "id": 7,
      "textQuestion": "Which of these is NOT considered a traditional Canadian food?",
      "options": [
        { "id": 1, "text": "Bannock" },
        { "id": 2, "text": "Beavertails" },
        { "id": 3, "text": "Saskatoon Berry Pie" },
        { "id": 4, "text": "Sushi" }
      ],
      "answer": { "id": 4, "text": "Sushi" },
      "explanation": {
        "id": 7,
        "text": "While sushi is popular in Canada, it originates from Japan."
      }
    },
    {
      "id": 8,
      "textQuestion": "What is a beavertail?",
      "options": [
        { "id": 1, "text": "A type of fish" },
        { "id": 2, "text": "A deep-fried pastry" },
        { "id": 3, "text": "A maple-flavored sausage" },
        { "id": 4, "text": "A Canadian-style pancake" }
      ],
      "answer": { "id": 2, "text": "A deep-fried pastry" },
      "explanation": {
        "id": 8,
        "text": "Beavertails are fried dough pastries, often topped with sugar, chocolate, or fruit, and are a popular Canadian treat."
      }
    },
    {
      "id": 9,
      "textQuestion": "Which Indigenous Canadian dish is made with fried dough?",
      "options": [
        { "id": 1, "text": "Pemmican" },
        { "id": 2, "text": "Toutons" },
        { "id": 3, "text": "Bannock" },
        { "id": 4, "text": "Flipper Pie" }
      ],
      "answer": { "id": 3, "text": "Bannock" },
      "explanation": {
        "id": 9,
        "text": "Bannock is a traditional Indigenous bread that can be baked or fried, and it has been a staple food for many Indigenous communities."
      }
    },
    {
      "id": 10,
      "textQuestion": "Which Canadian province is famous for its wild blueberries?",
      "options": [
        { "id": 1, "text": "Quebec" },
        { "id": 2, "text": "Manitoba" },
        { "id": 3, "text": "New Brunswick" },
        { "id": 4, "text": "British Columbia" }
      ],
      "answer": { "id": 1, "text": "Quebec" },
      "explanation": {
        "id": 10,
        "text": "Quebec is one of the top producers of wild blueberries, which are widely used in jams, desserts, and other dishes."
      }
    },
    {
      "id": 11,
      "textQuestion": "What is a traditional Newfoundland and Labrador dish made from salted fish and potatoes?",
      "options": [
        { "id": 1, "text": "Jiggs's Dinner" },
        { "id": 2, "text": "Fish and Brewis" },
        { "id": 3, "text": "Tourtière" },
        { "id": 4, "text": "Cod Tongues" }
      ],
      "answer": { "id": 2, "text": "Fish and Brewis" },
      "explanation": {
        "id": 11,
        "text": "Fish and Brewis is a traditional Newfoundland dish made with salted cod and hardtack (a type of biscuit) soaked in water and served together."
      }
    },
    {
      "id": 12,
      "textQuestion": "Which Canadian city is famous for its bagels?",
      "options": [
        { "id": 1, "text": "Toronto" },
        { "id": 2, "text": "Montreal" },
        { "id": 3, "text": "Vancouver" },
        { "id": 4, "text": "Calgary" }
      ],
      "answer": { "id": 2, "text": "Montreal" },
      "explanation": {
        "id": 12,
        "text": "Montreal-style bagels are smaller, denser, and slightly sweeter than New York-style bagels and are often baked in wood-fired ovens."
      }
    },
    {
      "id": 13,
      "textQuestion": "Which province is known for producing high-quality beef?",
      "options": [
        { "id": 1, "text": "Alberta" },
        { "id": 2, "text": "British Columbia" },
        { "id": 3, "text": "Ontario" },
        { "id": 4, "text": "Quebec" }
      ],
      "answer": { "id": 1, "text": "Alberta" },
      "explanation": {
        "id": 13,
        "text": "Alberta is famous for its cattle ranching industry and is known for producing some of the best beef in Canada."
      }
    },
    {
      "id": 14,
      "textQuestion": "Which type of salmon is most commonly found on the west coast of Canada?",
      "options": [
        { "id": 1, "text": "Atlantic salmon" },
        { "id": 2, "text": "Chinook salmon" },
        { "id": 3, "text": "Sockeye salmon" },
        { "id": 4, "text": "Pink salmon" }
      ],
      "answer": { "id": 3, "text": "Sockeye salmon" },
      "explanation": {
        "id": 14,
        "text": "Sockeye salmon is one of the most prized and abundant species of salmon found in British Columbia's waters."
      }
    },
    {
      "id": 15,
      "textQuestion": "Which Indigenous dish is made from dried meat, berries, and fat?",
      "options": [
        { "id": 1, "text": "Pemmican" },
        { "id": 2, "text": "Tourtière" },
        { "id": 3, "text": "Bannock" },
        { "id": 4, "text": "Poutine" }
      ],
      "answer": { "id": 1, "text": "Pemmican" },
      "explanation": {
        "id": 15,
        "text": "Pemmican was a staple food for Indigenous peoples and fur traders, as it provided a long-lasting and high-energy food source."
      }
    }
  ],

  "Festival_Dates_Common_Activities": [
    {
      "id": 1,
      "textQuestion": "When is Canada Day celebrated?",
      "options": [
        { "id": 1, "text": "June 24" },
        { "id": 2, "text": "July 1" },
        { "id": 3, "text": "August 15" },
        { "id": 4, "text": "September 5" }
      ],
      "answer": { "id": 2, "text": "July 1" },
      "explanation": {
        "id": 1,
        "text": "Canada Day is celebrated on July 1st each year, marking the anniversary of the confederation of Canada in 1867."
      }
    },
    {
      "id": 2,
      "textQuestion": "What is the main activity during the Calgary Stampede?",
      "options": [
        { "id": 1, "text": "Dog sledding" },
        { "id": 2, "text": "Rodeo competitions" },
        { "id": 3, "text": "Maple syrup tasting" },
        { "id": 4, "text": "Ice skating" }
      ],
      "answer": { "id": 2, "text": "Rodeo competitions" },
      "explanation": {
        "id": 2,
        "text": "The Calgary Stampede is a world-famous rodeo festival held in Alberta every July, featuring rodeo events, parades, and concerts."
      }
    },
    {
      "id": 3,
      "textQuestion": "Which Canadian holiday is known as the 'unofficial start of summer'?",
      "options": [
        { "id": 1, "text": "Victoria Day" },
        { "id": 2, "text": "Canada Day" },
        { "id": 3, "text": "Thanksgiving" },
        { "id": 4, "text": "Remembrance Day" }
      ],
      "answer": { "id": 1, "text": "Victoria Day" },
      "explanation": {
        "id": 3,
        "text": "Victoria Day is celebrated on the last Monday before May 25th and is often associated with fireworks, parades, and the beginning of summer activities."
      }
    },
    {
      "id": 4,
      "textQuestion": "What do people traditionally do on Remembrance Day?",
      "options": [
        { "id": 1, "text": "Go skiing" },
        { "id": 2, "text": "Watch fireworks" },
        { "id": 3, "text": "Wear poppies and observe a moment of silence" },
        { "id": 4, "text": "Carve pumpkins" }
      ],
      "answer": {
        "id": 3,
        "text": "Wear poppies and observe a moment of silence"
      },
      "explanation": {
        "id": 4,
        "text": "Remembrance Day, observed on November 11, honors soldiers who have died in wars, with Canadians wearing red poppies and holding a moment of silence at 11 AM."
      }
    },
    {
      "id": 5,
      "textQuestion": "When is Thanksgiving celebrated in Canada?",
      "options": [
        { "id": 1, "text": "The second Monday in October" },
        { "id": 2, "text": "The fourth Thursday in November" },
        { "id": 3, "text": "July 1" },
        { "id": 4, "text": "December 25" }
      ],
      "answer": { "id": 1, "text": "The second Monday in October" },
      "explanation": {
        "id": 5,
        "text": "Canadian Thanksgiving is celebrated on the second Monday in October, focusing on gratitude, family gatherings, and feasting."
      }
    },
    {
      "id": 6,
      "textQuestion": "Which festival in Quebec is known for its lively celebrations, traditional music, and vibrant street performances?",
      "options": [
        { "id": 1, "text": "Festival d'été de Québec" },
        { "id": 2, "text": "Montreal Jazz Festival" },
        { "id": 3, "text": "Quebec Winter Carnival" },
        { "id": 4, "text": "Celtic Colours International Festival" }
      ],
      "answer": { "id": 1, "text": "Festival d'été de Québec" },
      "explanation": {
        "id": 6,
        "text": "The Festival d'été de Québec is one of Canada's largest outdoor music festivals, featuring international and local artists performing in the heart of Quebec City each summer."
      }
    },
    {
      "id": 7,
      "textQuestion": "What do people do during the Toronto International Film Festival (TIFF)?",
      "options": [
        { "id": 1, "text": "Celebrate winter sports" },
        { "id": 2, "text": "Watch and premiere films" },
        { "id": 3, "text": "Eat traditional food" },
        { "id": 4, "text": "Observe a moment of silence" }
      ],
      "answer": { "id": 2, "text": "Watch and premiere films" },
      "explanation": {
        "id": 7,
        "text": "TIFF, held in September, is one of the world's largest film festivals, showcasing international and Canadian films."
      }
    },
    {
      "id": 8,
      "textQuestion": "Which holiday marks the end of the year and is celebrated with fireworks and parties?",
      "options": [
        { "id": 1, "text": "Victoria Day" },
        { "id": 2, "text": "Canada Day" },
        { "id": 3, "text": "New Year's Eve" },
        { "id": 4, "text": "Easter" }
      ],
      "answer": { "id": 3, "text": "New Year's Eve" },
      "explanation": {
        "id": 8,
        "text": "New Year's Eve, on December 31, is celebrated with fireworks, parties, and countdowns to welcome the new year."
      }
    },
    {
      "id": 9,
      "textQuestion": "Which holiday is celebrated with Halloween costumes and trick-or-treating?",
      "options": [
        { "id": 1, "text": "Christmas" },
        { "id": 2, "text": "Easter" },
        { "id": 3, "text": "Halloween" },
        { "id": 4, "text": "Labor Day" }
      ],
      "answer": { "id": 3, "text": "Halloween" },
      "explanation": {
        "id": 9,
        "text": "Halloween, on October 31, is celebrated with costumes, trick-or-treating, haunted houses, and spooky decorations."
      }
    },
    {
      "id": 10,
      "textQuestion": "What is the main tradition on Christmas Day in Canada?",
      "options": [
        { "id": 1, "text": "Lighting fireworks" },
        { "id": 2, "text": "Giving and receiving gifts" },
        { "id": 3, "text": "Holding a rodeo" },
        { "id": 4, "text": "Planting trees" }
      ],
      "answer": { "id": 2, "text": "Giving and receiving gifts" },
      "explanation": {
        "id": 10,
        "text": "Christmas, on December 25, is celebrated with family gatherings, gift-giving, and festive meals."
      }
    },
    {
      "id": 11,
      "textQuestion": "Which Canadian festival is known for its spectacular winter celebrations and ice sculptures?",
      "options": [
        { "id": 1, "text": "Winterlude" },
        { "id": 2, "text": "Calgary Stampede" },
        { "id": 3, "text": "Caribana" },
        { "id": 4, "text": "Toronto International Film Festival" }
      ],
      "answer": { "id": 1, "text": "Winterlude" },
      "explanation": {
        "id": 11,
        "text": "Winterlude is an annual festival held in Ottawa, featuring stunning ice sculptures, outdoor skating, and winter activities that attract visitors from around the world."
      }
    },
    {
      "id": 12,
      "textQuestion": "What is celebrated on February 2 in Canada, with a tradition involving a groundhog?",
      "options": [
        { "id": 1, "text": "Canada Day" },
        { "id": 2, "text": "Groundhog Day" },
        { "id": 3, "text": "Victoria Day" },
        { "id": 4, "text": "Remembrance Day" }
      ],
      "answer": { "id": 2, "text": "Groundhog Day" },
      "explanation": {
        "id": 12,
        "text": "On Groundhog Day, a groundhog's behavior is used to predict the length of winter; if it sees its shadow, winter will continue for six more weeks."
      }
    },
    {
      "id": 13,
      "textQuestion": "Which Canadian festival celebrates the arrival of spring with floral displays and parades?",
      "options": [
        { "id": 1, "text": "Tulip Festival" },
        { "id": 2, "text": "Montreal Jazz Festival" },
        { "id": 3, "text": "National Canada Day" },
        { "id": 4, "text": "Quebec Winter Carnival" }
      ],
      "answer": { "id": 1, "text": "Tulip Festival" },
      "explanation": {
        "id": 13,
        "text": "The Tulip Festival in Ottawa celebrates spring with millions of tulips blooming across the city and includes vibrant parades, cultural events, and art installations."
      }
    },
    {
      "id": 14,
      "textQuestion": "What is celebrated during the Nova Scotia International Tattoo festival?",
      "options": [
        { "id": 1, "text": "Traditional music and military performances" },
        { "id": 2, "text": "The founding of Nova Scotia" },
        { "id": 3, "text": "The arrival of European settlers" },
        { "id": 4, "text": "The harvest season" }
      ],
      "answer": {
        "id": 1,
        "text": "Traditional music and military performances"
      },
      "explanation": {
        "id": 14,
        "text": "The Nova Scotia International Tattoo festival, held annually in Halifax, celebrates traditional military and cultural performances with a focus on music, dance, and the military history of the region."
      }
    },
    {
      "id": 15,
      "textQuestion": "Which festival in Yukon celebrates the arrival of spring with outdoor activities and community events?",
      "options": [
        { "id": 1, "text": "Yukon Quest" },
        { "id": 2, "text": "Frostbite Music Festival" },
        { "id": 3, "text": "Sourdough Rendezvous" },
        { "id": 4, "text": "Klondike Gold Rush Festival" }
      ],
      "answer": { "id": 3, "text": "Sourdough Rendezvous" },
      "explanation": {
        "id": 15,
        "text": "Sourdough Rendezvous is a traditional winter festival in Whitehorse, Yukon, celebrating the end of winter with activities like ice sculpting, snowshoe races, and local music."
      }
    }
  ]
}
